Duet3D/Duet3Expansion/src/atmel/SAME51_DFP/1.1.129/edc/ATSAME51N19A.PIC
      <edc:AdjustPoint edc:_addr="0x4200008C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x42000090" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XIDAM" edc:impl="0x1FFFFFFF" edc:mclr="00011111111111111111111111111111" edc:nzwidth="0x20" edc:por="00011111111111111111111111111111" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="EIDM" edc:desc="Extended ID Mask" edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000094" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="HPMS" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="BIDX" edc:desc="Buffer Index" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="MSI" edc:desc="Message Storage Indicator" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No FIFO selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LOST" edc:desc="FIFO message lost" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FIFO0" edc:desc="Message stored in FIFO 0" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="FIFO1" edc:desc="Message stored in FIFO 1" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIDX" edc:desc="Filter Index" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="FLST" edc:desc="Filter List" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000098" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NDAT1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="ND0" edc:desc="New Data 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND1" edc:desc="New Data 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND2" edc:desc="New Data 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND3" edc:desc="New Data 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND4" edc:desc="New Data 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND5" edc:desc="New Data 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND6" edc:desc="New Data 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND7" edc:desc="New Data 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND8" edc:desc="New Data 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND9" edc:desc="New Data 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND10" edc:desc="New Data 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND11" edc:desc="New Data 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND12" edc:desc="New Data 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND13" edc:desc="New Data 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND14" edc:desc="New Data 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND15" edc:desc="New Data 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND16" edc:desc="New Data 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND17" edc:desc="New Data 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND18" edc:desc="New Data 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND19" edc:desc="New Data 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND20" edc:desc="New Data 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND21" edc:desc="New Data 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND22" edc:desc="New Data 22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND23" edc:desc="New Data 23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND24" edc:desc="New Data 24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND25" edc:desc="New Data 25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND26" edc:desc="New Data 26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND27" edc:desc="New Data 27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND28" edc:desc="New Data 28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND29" edc:desc="New Data 29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND30" edc:desc="New Data 30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND31" edc:desc="New Data 31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200009C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NDAT2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="ND32" edc:desc="New Data 32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND33" edc:desc="New Data 33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND34" edc:desc="New Data 34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND35" edc:desc="New Data 35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND36" edc:desc="New Data 36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND37" edc:desc="New Data 37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND38" edc:desc="New Data 38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND39" edc:desc="New Data 39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND40" edc:desc="New Data 40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND41" edc:desc="New Data 41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND42" edc:desc="New Data 42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND43" edc:desc="New Data 43" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND44" edc:desc="New Data 44" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND45" edc:desc="New Data 45" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND46" edc:desc="New Data 46" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND47" edc:desc="New Data 47" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND48" edc:desc="New Data 48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND49" edc:desc="New Data 49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND50" edc:desc="New Data 50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND51" edc:desc="New Data 51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND52" edc:desc="New Data 52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND53" edc:desc="New Data 53" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND54" edc:desc="New Data 54" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND55" edc:desc="New Data 55" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND56" edc:desc="New Data 56" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND57" edc:desc="New Data 57" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND58" edc:desc="New Data 58" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND59" edc:desc="New Data 59" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND60" edc:desc="New Data 60" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND61" edc:desc="New Data 61" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND62" edc:desc="New Data 62" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ND63" edc:desc="New Data 63" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
