Duet3D/Duet3Expansion/src/atmel/SAME51_DFP/1.1.129/edc/ATSAME51N19A.PIC
      <edc:SFRDef edc:_addr="0x42000414" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="RWD" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="WDC" edc:desc="Watchdog Configuration" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="WDV" edc:desc="Watchdog Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000418" edc:access="----------------nnnn--nnnnnnnnnn" edc:cname="CCCR" edc:impl="0xF3FF" edc:mclr="00000000000000000000000000000001" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="INIT" edc:desc="Initialization" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCE" edc:desc="Configuration Change Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ASM" edc:desc="ASM Restricted Operation Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSA" edc:desc="Clock Stop Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:desc="Clock Stop Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON" edc:desc="Bus Monitoring Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAR" edc:desc="Disable Automatic Retransmission" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEST" edc:desc="Test Mode Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FDOE" edc:desc="FD Operation Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRSE" edc:desc="Bit Rate Switch Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PXHD" edc:desc="Protocol Exception Handling Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFBI" edc:desc="Edge Filtering during Bus Integration" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXP" edc:desc="Transmit Pause" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NISO" edc:desc="Non ISO Operation" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200041C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:cname="NBTP" edc:impl="0xFFFFFF7F" edc:mclr="00000110000000000000101000000011" edc:nzwidth="0x20" edc:por="00000110000000000000101000000011" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="NTSEG2" edc:desc="Nominal Time segment after sample point" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NTSEG1" edc:desc="Nominal Time segment before sample point" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NBRP" edc:desc="Nominal Baud Rate Prescaler" edc:nzwidth="0x9"/>
            <edc:SFRFieldDef edc:cname="NSJW" edc:desc="Nominal (Re)Synchronization Jump Width" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000420" edc:access="------------nnnn--------------nn" edc:cname="TSCC" edc:impl="0xF0003" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TSS" edc:desc="Timestamp Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="ZERO" edc:desc="Timestamp counter value always 0x0000" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INC" edc:desc="Timestamp counter value incremented by TCP" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="EXT" edc:desc="External timestamp counter value used" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="TCP" edc:desc="Timestamp Counter Prescaler" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000424" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="TSCV" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TSC" edc:desc="Timestamp Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000428" edc:access="nnnnnnnnnnnnnnnn-------------nnn" edc:cname="TOCC" edc:impl="0xFFFF0007" edc:mclr="11111111111111110000000000000000" edc:nzwidth="0x20" edc:por="11111111111111110000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="ETOC" edc:desc="Enable Timeout Counter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOS" edc:desc="Timeout Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CONT" edc:desc="Continuout operation" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TXEF" edc:desc="Timeout controlled by TX Event FIFO" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RXF0" edc:desc="Timeout controlled by Rx FIFO 0" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RXF1" edc:desc="Timeout controlled by Rx FIFO 1" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="TOP" edc:desc="Timeout Period" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
