Duet3D/Duet3Expansion/src/atmel/SAME51_DFP/1.1.129/edc/ATSAME51N19A.PIC
      <edc:AdjustPoint edc:_addr="0x4300204A" edc:offset="0x3B6"/>
      <edc:SFRDef edc:_addr="0x43002400" edc:access="------nn" edc:cname="CTRLA" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable DAC Controller" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002401" edc:access="-----nnn" edc:cname="CTRLB" edc:impl="0x7" edc:mclr="00000010" edc:nzwidth="0x8" edc:por="00000010" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DIFF" edc:desc="Differential mode enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Selection for DAC0/1" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="VREFPU" edc:desc="External reference unbuffered" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VDDANA" edc:desc="Analog supply" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="VREFPB" edc:desc="External reference buffered" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="INTREF" edc:desc="Internal bandgap reference" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002402" edc:access="nnnnnnnn" edc:cname="EVCTRL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="STARTEI0" edc:desc="Start Conversion Event Input DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTEI1" edc:desc="Start Conversion Event Input DAC 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO0" edc:desc="Data Buffer Empty Event Output DAC 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO1" edc:desc="Data Buffer Empty Event Output DAC 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI0" edc:desc="Enable Invertion of DAC 0 input event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEI1" edc:desc="Enable Invertion of DAC 1 input event" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDYEO0" edc:desc="Result Ready Event Output 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDYEO1" edc:desc="Result Ready Event Output 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43002403" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x43002404" edc:access="nnnnnnnn" edc:cname="INTENCLR" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:desc="Underrun 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:desc="Underrun 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:desc="Data Buffer 0 Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:desc="Data Buffer 1 Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDY0" edc:desc="Result 0 Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDY1" edc:desc="Result 1 Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN0" edc:desc="Overrun 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN1" edc:desc="Overrun 1 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002405" edc:access="nnnnnnnn" edc:cname="INTENSET" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:desc="Underrun 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:desc="Underrun 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:desc="Data Buffer 0 Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:desc="Data Buffer 1 Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDY0" edc:desc="Result 0 Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDY1" edc:desc="Result 1 Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN0" edc:desc="Overrun 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN1" edc:desc="Overrun 1 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002406" edc:access="nnnnnnnn" edc:cname="INTFLAG" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:desc="Result 0 Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:desc="Result 1 Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:desc="Data Buffer 0 Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:desc="Data Buffer 1 Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDY0" edc:desc="Result 0 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDY1" edc:desc="Result 1 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN0" edc:desc="Result 0 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN1" edc:desc="Result 1 Overrun" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
